Tekla.Structures.Geometry3d.AABB
The AABB class represents an axis-aligned 3d bounding box.
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
using System;
public class Example
{
public void Example1()
{
Beam MyBeam1 = new Beam();
Beam MyBeam2 = new Beam();
Solid MySolid1 = MyBeam1.GetSolid();
Solid MySolid2 = MyBeam2.GetSolid();
AABB MyAxisAlignedBoundingBox1 = new AABB(MySolid1.MinimumPoint, MySolid1.MaximumPoint);
AABB MyAxisAlignedBoundingBox2 = new AABB(MySolid2.MinimumPoint, MySolid2.MaximumPoint);
if (MyAxisAlignedBoundingBox1.Collide(MyAxisAlignedBoundingBox2))
{
Console.WriteLine("Collision between beams!");
}
}
}

Tekla.Structures.Geometry3d.AABB.MinPoint
The minimum point of the axis-aligned 3d bounding box.

Tekla.Structures.Geometry3d.AABB.MaxPoint
The maximum point of the axis-aligned 3d bounding box.

Tekla.Structures.Geometry3d.AABB.#ctor
Instantiates a new axis-aligned 3d bounding box with the maximum point
initialized to the smallest possible value and the minimum point to the
largest possible value.

Tekla.Structures.Geometry3d.AABB.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Instantiates a new axis-aligned 3d bounding box with the given minimum and maximum points.
MinPoint: The minimum point to be used.
MaxPoint: The maximum point to be used.

Tekla.Structures.Geometry3d.AABB.#ctor(Tekla.Structures.Geometry3d.AABB)
Instantiates a new axis-aligned 3d bounding box which is a copy
of the given axis-aligned 3d bounding box.
AABB: The axis-aligned 3d bounding box to copy from.

Tekla.Structures.Geometry3d.AABB.IsInside(Tekla.Structures.Geometry3d.Point)
Checks if the given point is inside the current axis-aligned 3d bounding box.
Point: The point to be checked.
Returns: True if the point is inside the current axis-aligned 3d bounding box.

Tekla.Structures.Geometry3d.AABB.IsInside(Tekla.Structures.Geometry3d.LineSegment)
Checks if the given line segment is inside the current axis-aligned 3d bounding box.
LineSegment: The line segment to be checked.
Returns: True if the point is inside the current axis-aligned 3d bounding box.

Tekla.Structures.Geometry3d.AABB.GetCenterPoint
Returns the geometric center point of the current axis-aligned 3d bounding box.
Returns: The geometric center point of the current axis-aligned 3d bounding box.

Tekla.Structures.Geometry3d.AABB.Collide(Tekla.Structures.Geometry3d.AABB)
Checks if the current axis-aligned 3d bounding box collides with
another given axis-aligned 3d bounding box. Both axis-aligned 3d
bounding boxes need to be in the same coordinate system or in the
same workplane, so that they are defined using the same axes.
Other: Another axis-aligned 3d bounding box to be used in the collision check.
Returns: True if the axis-aligned 3d bounding boxes collide.

Tekla.Structures.Geometry3d.AABB.op_Addition(Tekla.Structures.Geometry3d.AABB,Tekla.Structures.Geometry3d.AABB)
Combines (adds) the given two axis-aligned 3d bounding boxes.
AABB1: The first axis-aligned 3d bounding box to combine.
AABB2: The second axis-aligned 3d bounding box to combine.
Returns: The new combined axis-aligned 3d bounding box.

Tekla.Structures.Geometry3d.AABB.op_Addition(Tekla.Structures.Geometry3d.AABB,Tekla.Structures.Geometry3d.Point)
Adds the given point to the given axis-aligned 3d bounding box.
AABB: The axis-aligned 3d bounding box to add to.
Point: The point to be added.
Returns: The new axis-aligned 3d bounding box which includes the
given axis-aligned 3d bounding box and the given point.

Tekla.Structures.Geometry3d.AABB.op_Addition(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.AABB)
Adds the given point to the given axis-aligned 3d bounding box.
Point: The point to be added.
AABB: The axis-aligned 3d bounding box to add to.
Returns: The new axis-aligned 3d bounding box which includes the given
axis-aligned 3d bounding box and the given point.